app/views/parts/_form.html.erb

    <%= form.label :supplier_id %>
    <%= form.collection_select :supplier_id,Supplier.all, :id, :name,prompt:"Select on supplier" %>
---
SELECT "suppliers".* FROM "suppliers"