app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= form.label :author_id %>
    <%= form.collection_select :author_id,Author.all, :id, :name,prompt:"Selecione um autor" %>