app/controllers/assemblies_controller.rb

  def index
    @assemblies = Assembly.all
---
SELECT "assemblies".* FROM "assemblies"

  def create
    @assembly = Assembly.new(assembly_params)

    respond_to do |format|
      if @assembly.save
---
INSERT INTO "assemblies" ("assembly_reg", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["assembly_reg", ""], ["created_at", "2024-05-27 13:11:56.505380"], ["updated_at", "2024-05-27 13:11:56.505380"]]

  def update
    respond_to do |format|
      if @assembly.update(assembly_params)
---
UPDATE "assemblies" SET "assembly_reg" = $1, "updated_at" = $2 WHERE "assemblies"."id" = $3  [["assembly_reg", "1232ABC"], ["updated_at", "2024-02-29 12:45:16.634401"], ["id", 2]]

  def destroy
    @assembly.destroy!
---
DELETE FROM "assemblies" WHERE "assemblies"."id" = $1  [["id", 1]]

    def set_assembly
      @assembly = Assembly.find(params[:id])
---
SELECT "assemblies".* FROM "assemblies" WHERE "assemblies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]