app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "jo soares"], ["created_at", "2024-05-27 13:02:08.834617"], ["updated_at", "2024-05-27 13:02:08.834617"]]