app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "description", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"