app/controllers/parts_controller.rb

INSERT INTO "parts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "capa dura"], ["created_at", "2024-05-27 13:42:09.800428"], ["updated_at", "2024-05-27 13:42:09.800428"]]
---
  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save

UPDATE "parts" SET "name" = $1, "updated_at" = $2 WHERE "parts"."id" = $3  [["name", "Capa Mole"], ["updated_at", "2024-03-05 13:36:59.723016"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @part.update(part_params)

DELETE FROM "parts" WHERE "parts"."id" = $1  [["id", 1]]
---
  def destroy
    @part.destroy!