app/controllers/suppliers_controller.rb

  def create
    @supplier = Supplier.new(supplier_params)

    respond_to do |format|
      if @supplier.save
---
INSERT INTO "suppliers" ("name", "created_at", "updated_at", "cnpj") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["created_at", "2024-06-06 02:28:25.046510"], ["updated_at", "2024-06-06 02:28:25.046510"], ["cnpj", nil]]

  def update
    respond_to do |format|
      if @supplier.update(supplier_params)
---
UPDATE "suppliers" SET "name" = $1, "updated_at" = $2 WHERE "suppliers"."id" = $3  [["name", "Deco The best Eggs"], ["updated_at", "2024-02-16 14:54:55.900209"], ["id", 4]]

  def destroy
    @supplier.destroy!
---
DELETE FROM "suppliers" WHERE "suppliers"."id" = $1  [["id", 1]]

    def set_supplier
      @supplier = Supplier.find(params[:id])
---
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]