app/views/assemblies/_assembly.html.erb

  </strong>
  <%if assembly.parts.any?%>
    <ul>
      <%assembly.parts.each do |part| %>
---
SELECT "parts".* FROM "parts" INNER JOIN "assemblies_parts" ON "parts"."id" = "assemblies_parts"."part_id" WHERE "assemblies_parts"."assembly_id" = $1  [["assembly_id", 3]]
SELECT 1 AS one FROM "parts" INNER JOIN "assemblies_parts" ON "parts"."id" = "assemblies_parts"."part_id" WHERE "assemblies_parts"."assembly_id" = $1 LIMIT $2  [["assembly_id", 4], ["LIMIT", 1]]
SELECT "parts".* FROM "parts" INNER JOIN "assemblies_parts" ON "parts"."id" = "assemblies_parts"."part_id" WHERE "assemblies_parts"."assembly_id" = $1  [["assembly_id", 4]]

  <strong>Books:</strong>
  <% if assembly.books.any? %>
    <ul>
      <% assembly.books.each do |book| %>
---
SELECT "books".* FROM "books" INNER JOIN "assemblies_books" ON "books"."id" = "assemblies_books"."book_id" WHERE "assemblies_books"."assembly_id" = $1  [["assembly_id", 8]]
SELECT 1 AS one FROM "books" INNER JOIN "assemblies_books" ON "books"."id" = "assemblies_books"."book_id" WHERE "assemblies_books"."assembly_id" = $1 LIMIT $2  [["assembly_id", 4], ["LIMIT", 1]]