app/views/assemblies/_form.html.erb

SELECT "parts".* FROM "parts"
---
  <div >
    <%= collection_check_boxes(:assembly, :part_ids, Part.all, :id, :name) %>

SELECT "books".* FROM "books"
---
  <div>
    <%= collection_check_boxes(:assembly, :book_ids, Book.all, :id, :title) %>