app/views/accounts/_form.html.erb

SELECT "suppliers".* FROM "suppliers"
---
    <%= form.label :supplier_id %>
    <%= form.collection_select :supplier_id,Supplier.all, :id, :name,prompt:"Select on supplier" %>